In [2]:
import pandas as pd
import numpy as np 
from numpy.random import randn 
import jedi

In [3]:
labels = ["a" , "b", "c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"a" : 10 , "b" : 20, "c" : 30}

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data= my_data , index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4],["USA","GER","USSR", "JPN"])

In [11]:
ser1

USA     1
GER     2
USSR    3
JPN     4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4],["USA","GER","ITA", "JPN"])

In [13]:
ser2

USA    1
GER    2
ITA    5
JPN    4
dtype: int64

In [14]:
ser2["ITA"]

5

In [15]:
ser3 = pd.Series(labels)

In [16]:
ser3

0    a
1    b
2    c
dtype: object

In [17]:
ser3[0]

'a'

In [18]:
ser1

USA     1
GER     2
USSR    3
JPN     4
dtype: int64

In [19]:
ser2

USA    1
GER    2
ITA    5
JPN    4
dtype: int64

In [20]:
ser1+ser2

GER     4.0
ITA     NaN
JPN     8.0
USA     2.0
USSR    NaN
dtype: float64

In [21]:
np.random.seed(101)

In [150]:
df = pd.DataFrame(randn(5,4), ["A","B","C","D","E"],["W","X","Y","Z"])

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [25]:
df["new"] = df["W"] + df["Y"]

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
df.drop("new",axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
df.drop("new",axis = 1, inplace = True )

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
df.shape

(5, 4)

In [33]:
#Selecting Rows

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [36]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [37]:
df.loc["B", "Y"]

-0.8480769834036315

In [38]:
df.loc[["A","B"], ["X","Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [39]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [40]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df["W"]> 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
result_df = df[df["W"]>0]

In [44]:
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
result_df["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[["Y","X"]]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
C  0.528813  0.740122
D -0.933237 -0.758872
E  2.605967  1.978757

In [48]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [49]:
df[df["W"]>0][["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
D  0.188695  0.955057
E  0.190794  0.683509

In [50]:
(df["W"]> 0) & (df["X"]<0)

A    False
B     True
C    False
D     True
E    False
dtype: bool

In [51]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [52]:
newind = "CA NY WY OR CO".split()

In [53]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [54]:
df["States"] = newind

In [55]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [56]:
df.set_index("States")

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [58]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [59]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [60]:
inside

[1, 2, 3, 1, 2, 3]

In [61]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [62]:
df = pd.DataFrame(randn(6,2),hier_index, "A B".split())

In [63]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [64]:
df.loc["G1"].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [65]:
df.index.names

FrozenList([None, None])

In [66]:
df.index.names = "Groups Numbers".split()

In [67]:
df

                       A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646

In [68]:
df.loc["G2"]

                A         B
Numbers
1        0.166905  0.184502
2        0.807706  0.072960
3        0.638787  0.329646

In [69]:
df.loc["G2"].loc[2]["B"]

0.07295967531703869

In [70]:
df.xs

<bound method NDFrame.xs of                        A         B
Groups Numbers
G1     1        0.302665  1.693723
       2       -1.706086 -1.159119
       3       -0.134841  0.390528
G2     1        0.166905  0.184502
       2        0.807706  0.072960
       3        0.638787  0.329646>

In [71]:
df.loc["G1"]

                A         B
Numbers
1        0.302665  1.693723
2       -1.706086 -1.159119
3       -0.134841  0.390528

In [72]:
df.xs(1,level = "Numbers")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [73]:
df.xs(1, level = "Numbers")

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [74]:
d = {"A":[1,2,np.nan] , "B":[5,np.nan,np.nan] , "C":[1,2,3]}

In [75]:
df = pd.DataFrame(d)

In [76]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [77]:
df.dropna(axis= 1)

   C
0  1
1  2
2  3

In [78]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [82]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [83]:
df.fillna(value = "Fill value")

            A           B  C
0         1.0         5.0  1
1         2.0  Fill value  2
2  Fill value  Fill value  3

In [90]:
df["A"] = df["A"].fillna(value= df["A"].mean())

In [91]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [92]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [94]:
df = pd.DataFrame(data)

In [95]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [105]:
byComp = df.groupby("Company")

In [101]:
byComp.mean()

/var/folders/gh/ldk8nl9n7d185fs3kw1yml500000gn/T/ipykernel_11944/1270089407.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [103]:
byComp.sum().loc["FB"]

/var/folders/gh/ldk8nl9n7d185fs3kw1yml500000gn/T/ipykernel_11944/1316145463.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [109]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [113]:
df.groupby("Company").describe().transpose()["FB"]

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [114]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [115]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [118]:
df["col2"].nunique()

3

In [119]:
df["col2"].unique()

array([444, 555, 666])

In [121]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [122]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [125]:
df[(df["col1"]>2) & (df["col2"]==444)]

   col1  col2 col3
3     4   444  xyz

In [130]:
def times2 (x) : 
    return x*2

In [131]:
df["col1"]

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [129]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [133]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [135]:
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [136]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [138]:
df.drop("col1",axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [139]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [140]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [141]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [143]:
df.sort_values(by = "col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [145]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [146]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [147]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [149]:
df.pivot_table(values = "D", index = ["A" , "B"], columns = ["C"])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN